[
  {
    "id": "1768866801997",
    "title": "Season 1, Episode 1 - \"Pilot\"",
    "date": "January 19, 2026",
    "content": "Step By Step is nobody's favorite sitcom, and I am convinced that no one has ever watched this show on purpose. This show is Miller-Boyett propaganda that tries, unsuccessfully, to demonstrate that white people were cool in the 90's. Not even Patrick Duffy could save this trainwreck, and he survived being shot in the shower on Dallas.\n\nBefore we venture further into the Step By Step Cinematic Universe (a.k.a. the **SBSCU**), let's look at a brief bit of background to provide some context for where the SBSCU fits into the Greater Miller-Boyett Television Universe (**GM-BTU**):\n\n## The Historical Context Nobody Asked For\n\nThe year was **1991**. \n\n![1991.jpg](stepbystepreviewed/1991.jpg)\n\nThomas L. Miller (not pictured) had already been belting out the sitcom bangers for nearly 20 years at this point. His companies were behind a myriad of classic sitcoms like Happy Days, Joanie Loves Chachie, and Mork & Mindy. At the time, Miller-Boyett Productions was actively producing Full House, Perfect Strangers, AND Family Matters. By 1991, Miller-Boyett Productions already had three shows running in ABC's TGIF lineup: Full House, Perfect Strangers, and Family Matters. Step By Step gave them total domination - all four slots of the 2-hour Friday night block belonged to one production company. \n\nStep By Step then ran for seven godless seasons, consistently and firmly wedged in between other, better sitcoms that people actually wanted to watch. \n\n![tgif.jpg](stepbystepreviewed/tgif.jpg)\n\nAnd then that was it. The GM-BTU (**Greater Miller-Boyett Television Universe**) was over. Miller-Boyett Productions split up. A new offshoot company was formed; they made two terrible sitcoms that were canceled after one season. The entire GM-BTU was brought to its knees by the awful, beige power of Step By Step; and there it would remain, until Full House emerged from its insipid-90's-sitcom cocoon as Fuller House nearly 20 years later.\n\nNow we're in the right frame of mind to understand BJD's GM-BSBSCH (**Big Juicy Doug's Greater Miller-Boyett Step By Step Collapse Hypothesis**). Don't just take my word for it though - read on to fully understand. Well, based on my evidence. So I guess you're still taking my word for it.\n\n## The Opening Credits: A Descent Into Madness\n\n![intro.jpg](stepbystepreviewed/intro.jpg)\n\nOkay, stop. 1 second into the show. You hear that? There's that sweet family-friendly guitar riff taking us on a ride to Sitcom Town. I like to think I'm a fair reviewer. I'm not, but I like to think so anyway. So I have to give credit where credit is due - Step By Step (which is not The Brady Bunch) is definitely much edgier and hipper than The Brady Bunch (which is a different show), because the theme song contains an electric guitar. Like rock and roll. Ever heard of it?\n\nGet ready because this intro dumps 11 characters on you. **Eleven.** This show probably ended the GM-BTU simply due to reaching critical mass of corny sitcom stereotypes.\n\nYou've got the responsible daughter, the vain daughter, and the tomboy daughter; the jock son, the nerd son, and the annoying youngest child son; the schlubby dad, the beauty queen mom who used to be on Three's Company, an old lady and Patrika Darbo. There is also the older cousin, who acts like a combination of Bill and Ted, but doesn't ever smoke weed because smoking a joint is tantamount to snorting fentanyl in 90's Sitcomland. \n\nThat's too many people. That's a small army. That's a cult. \n\n![jt_intro.jpg](stepbystepreviewed/jt_intro.jpg)\n\nOh god. It's this fucking kid. JT. The worst sitcom child of all time. It's all downhill from here. Say what you want about Steve Urkel, but at least he had good intentions.\n\n\n### A Brief Detour Into Steve Urkel Territory\n\nActually, on second thought, Steve Urkel caused thousands of dollars of property damage to the working class Winslows on a regular basis. He kicked them off their own show—it literally got renamed from \"Family Matters\" to \"The Steve Urkel Show\" (trust me, no need to look that up). He chased their daughter ruthlessly despite her many rejections, which in any other context would result in a restraining order. Steve Urkel is a bourgeoisie spy, planted by the upper crust to keep the Winslows down forever. Where did he get the money for all those inventions? Who funded the transformation chamber? \n\nSteve Urkel is an enemy of the working class. Damn him. Straight to hell I say. He did invent the Urkel Dance though. You cannot deny him that. The Urkel Dance slapped and you know it.\n\nThanks for reading my review of Step By Step. Oh wait, we're only 90 seconds in. Fuck.\n\n## The Intro Song: Welcome to Beige Hell\n\nSo next the children of the damned start singing the intro song and you know you've left your comfortable mortal realm and entered Beige Hell. The lyrics are painfully optimistic in that uniquely 90's sitcom way, where every problem can be solved in 22 minutes and everyone learns a valuable lesson about respecting each other's boundaries or whatever. It's the musical equivalent of a corporate team-building exercise. \"We're all going to get along! Whether we like it or not! This is fine! Everything is fine!\"\n\n\n![darbo_intro.jpg](stepbystepreviewed/darbo_intro.jpg)\n\nAh, Patrika Darbo. An extremely nuanced and intricate character. Here is what Wikipedia has to say:\n\n\"Penny Baker Williams (season 1), Carol's man-hungry sister.\"\n\nThat's it. That's the entire character. \"Man-hungry.\" In 1991, this passed for character development. Her entire personality is \"wants to bone\" and \"is related to the main character.\" She exists solely to make inappropriate comments about men and to give Carol someone to talk to during the boring exposition scenes. \n\nShe was denied her Emmy. I'm joking of course; she was never nominated, because the Academy has no taste. Unfortunately, she doesn't make it to season 2. Maybe they realized 8 main characters was enough. For a few seasons at least, before they eventually went ahead and added two more main characters anyway, because this show hates itself and wants to die but ABC won't let it.\n\n![mark_sucks.jpg](stepbystepreviewed/mark_sucks.jpg)\n\nOh god, it's this fucking kid. Part two. Mark. The worst sitcom child of all time. Mark is what happens when writers create a character solely to be annoying and then realize too late that they have to write episodes about him for seven years. \n\nThe very first thing we see Mark do in this show is sneeze into his popcorn and blow it everywhere like he's a shitty Big Bad Wolf. Dude couldn't even make it through the opening credits without sucking.What a fucking idiot, eat your snot-covered popcorn off the ground. They filmed this, looked at it, and said \"yes, this represents our show perfectly.\" And you know what? They were right. This show is floor popcorn.\n\n![old_lady_waving.jpg](stepbystepreviewed/old_lady_waving.jpg)\n\nWave goodbye to the rest of the cast old lady, because you too shall be Patrika Darbo'd. One by one, characters will disappear from this show, and no one will mention them again. They'll just vanish like they were raptured, except instead of heaven they went to pilot season hell.\n\n![duffy_doom.jpg](stepbystepreviewed/duffy_doom.jpg)\n\nA sad scene as Frank (Patrick Duffy) is the only one to notice the roller coaster about to fly off the tracks into oblivion. Look at his face. He knows. He's thinking about his Dallas money. He's thinking about how he could be literally anywhere else. God's punishment for his sinful vacation where he met Suzanne Somers and decided to marry her and combine their feral broods of children.\n\n![miller-b.jpg](stepbystepreviewed/miller-b.jpg)\n\nSome say these intro credits are the last thing you see before you die. Scientists have studied near-death experiences and found that 67% of people report seeing a blinding white light, 23% report seeing deceased loved ones, and 10% report seeing the Step By Step intro credits.\n\n## Act One: The Lamberts Are Disgusting\n\n![sloppyshit.jpg](stepbystepreviewed/sloppyshit.jpg)\n\nThese are the Lamberts: Frank the dad; JT the jock son; Al (short for Alicia) the tomboy daughter , and Brendan, the annoying young son who will eventually get replaced by an annoying young daughter once he stops being cute. They're a bunch of nasty-ass slobs, and the show wants you to know this immediately. The house looks like a frat house after rush week, there's shit all over the place.\n\nFrank walks in and announces he's been gone a week. Just casually mentions he abandoned his children for seven days. Finally, a realistic portrayal of parenthood: sometimes you just need to fuck off to Jamaica without your kids and pretend you're still young and free. Frank hates his children. This makes Frank the most relatable character in the entire GM-BTU. \n\nThe kids complain that they have no food. Right off the bat Frank is a horrible father and a slob, which is pretty rad. I wonder if they were trying to do an anti-Danny Tanner from Full House thing and make the dad in this show the nastiest dude on the planet. Unfortunately he is a cheesy fucking cornball just like Danny Tanner so they failed. You can make a dad character \"edgy\" by making him messy, but you can't escape the fundamental requirement that he has to learn a lesson and hug his kids at the end of every episode.\n\n## Meanwhile, at the Beauty Salon of Exposition\n\n![salon-talk.jpg](stepbystepreviewed/salon-talk.jpg)\n\nPatrika Darbo and old lady (she might have a name, who gives a shit—it's their mom, I think? An aunt? A lady who works there? The show doesn't care and neither do I) grill Suzanne Somers about meeting a man. Apparently she was in Jamaica. Again, without her kids. Hell yeah. \n\nBoth parents in this show just independently decided to abandon their children and go to Jamaica. They just both separately thought \"fuck them kids\" and booked tickets to the same island. What are the odds? It's fate, except fate is just shared parental neglect. Actually, it’s much worse than that, but we’ll get to that in a minute.\n\nSuzanne Somers' actual first line in the entire show is \"..and then I said fuck them kids and got me some Duffy D you feel me?\" I was as surprised as you are. I never thought that would fly in 1991. I think maybe every sitcom got one F-bomb and they used theirs immediately, which honestly was a bold choice. Respect.\n\n## The Pants-Creaming Incident\n\n![pants-creaming.jpg](stepbystepreviewed/pants-creaming.jpg)\n\nFrank walks into the salon looking for...I don't know, probably a haircut or something. Men get haircuts. That's a thing they do. Patrika Darbo spots him and immediately, audibly, visually creams her pants. Like, the second she lays eyes upon him. \n\nHer reaction is so over-the-top that you'd think Frank just walked in shirtless covered in baby oil, but no, he's just a regular-ass dude. Penny practically levitates out of her chair. Her eyes go wide. Steam starts coming out of her ears. Her tongue rolls onto the floor as she begins shouting \"AWOOGA! AWOOGA! HUMMINA HUMMINA HUMMINA...\" You know the drill.  It turns out Penny and Frank already know each other which makes this whole situation a lot weirder.\n\nImagine if you walked into a salon and Patrika Darbo looked you dead in the eyes and audibly jizzed her pants. Just locked eyes with you and had a full physical reaction to your mere presence. It would be a very awkward haircut after that. You'd have to sit there while she's cutting your hair, both of you knowing what happened, neither of you acknowledging it. That's psychological warfare.\n\nJoke's on her though. That's Suzanne Somers' man. Turns out they met in Jamaica (convenient!) and now they're dating or getting married or whatever the pilot needs them to be doing to force these families together. Carol sees Frank and her face lights up, and you can see Penny die a little inside.\n\nSorry Penny, you can't have this one. He's taken. He's going to go combine his disgusting feral children with Suzanne Somers' prissy perfect children and create a sitcom nightmare that will last seven seasons. You're going to disappear after 22 episodes and no one will ever mention you again.\n\n## Mark's Giant Balls and Karen's Zit\n\n![mark-big-balls.jpg](stepbystepreviewed/mark-big-balls.jpg)\n\nWe are introduced to the second half of the children, Suzanne Somers' half: Dana, the responsible older daughter; Karen, the vain and probably adopted middle daughter; and Mark, the nerd-ass geek boy. Karen complains about having a zit while Mark plops his giant balls on the kitchen table. Mark's balls are never brought up again. Karen's zit, however, plays the important role of B plot in a shitty 90s sitcom. Spoiler alert: the zit subplot gets two whole scenes. Yes, this is television.\n\n## A Purely Sexual Relationship\n\n![ss-overacting.jpg](stepbystepreviewed/ss-overacting.jpg)\n\nThis next scene is….terrible? Uncomfortable? Deeply problematic in ways that 1991 couldn't even comprehend? The gist of this scene is: Suzanne Somers and Frank got married in Jamaica. Not engaged. Married. They skipped right past all the reasonable steps and went straight to legally binding matrimony in a foreign country. Suzanne Somers wants to call it off because she thinks their relationship is \"purely sexual.\" She thinks maybe their kids won't be okay with their freaky Jamaican sex marriage. You know, reasonable concerns to have before you marry someone you barely know.\n\n![frankdontcare.jpg](stepbystepreviewed/frankdontcare.jpg)\n\nFrank is A-OK with all of this. He is the horniest man on planet Earth. His brain has been completely replaced by his penis. Oh also it turns out it wasn't actually a coincidence that they both ended up in Jamaica - Frank just got information from Suzanne Somers' travel agent in order to stalk her on her trip to Jamaica. He literally tracked her down on her vacation.  She seems pretty unbothered by this revelation, which tells you everything you need to know about the quality of writing on this show. Trust me, if she was bothered you would know, because she is overacting the hell out of this scene.\n\n## \"It was alive when I put it in there!\"\n\n![rat-boy.jpg](stepbystepreviewed/rat-boy.jpg)\n\nThe parents have the genius plan to slowly introduce their two families. You know, ease them into it. Maybe a nice dinner, some small talk, let everyone get comfortable. Except, uh oh, turns out Dana and JT hate each other already. What are the odds! It's almost like the writers needed immediate conflict and didn't want to waste time building to it organically!\n\nDana hates JT for putting a rat in her locker, which presumably starved to death and died. What the fuck? Who does that? There's no backstory here. No \"she embarrassed me so I got revenge.\" He just decided one day to trap a living creature in her locker and let nature take its course. But it's okay, JT quips back: \"it was alive when I put it in there!\" \n\nBoom! Zing! Bazinga! It's funny because the animal died a slow, terrified death trapped in a metal box. Classic! So as you can see, this is why they hate each other. Dana hates JT because he's an awful human being who does disgusting, insane shit like putting live animals in her locker to die. And JT hates Dana for…not liking when he puts live animals in her locker to die. She's such a buzzkill! Can't even appreciate a good locker rat-murder prank. \n\n## Detective Darbo Solves the Case\n\n![detective-darbo.jpg](stepbystepreviewed/detective-darbo.jpg)\n\nNext we have a quick cut to Detective Darbo who is working on the Case of the Mysterious Jamaican Coitus. She's putting the pieces together. The vacation. The glow. The way Suzanne Somers can't stop smiling like an idiot. The way Frank follows Suzanne Somers around the backyard dry-humping her leg. Penny's detective skills are being wasted on this family. She should be solving murders, not figuring out which of her relatives are getting railed on tropical islands.\n\n## Frank's Weaponized Incompetence\n\n![franks-black-burgers.jpg](stepbystepreviewed/franks-black-burgers.jpg)\n\nFrank is the final boss of weaponized incompetence sitcom dads. He can't even make burgers. They're black. Completely charred. **Inedible.** How do you fuck up burgers that badly? You just put them on heat and wait. That's it. That's the whole recipe. But no, Frank has somehow created burger-shaped lumps of carbon. \n\nOld lady complains about how every time she eats outside she gets bugs in her teeth(???), Darbo tells her to shut the fuck up, old lady says \"no u,\" and honestly I can't imagine why these characters didn't last. Real mystery there.\n\nSo. Karen screams because Al got a little bit of ketchup on her shirt. A tiny drop. A bit of an overreaction, maybe Karen should lighten up a little! So Al responds, \"if I wanted to get ketchup on your shirt, I would have done THIS!\" and then sprays her with ketchup. Just full-on squirts the bottle at her. \n\n![squirting.jpg](stepbystepreviewed/squirting.jpg)\n\nWhat is wrong with these people? Is this supposed to show that the Lamberts are like, lighthearted or something? Fun-loving? Because they kind of come across as awful cavemen who solve minor inconveniences with condiment-based warfare. Dana even says, verbatim, \"you people are SAVAGES!\" And I guess this is supposed to show she's stuck up but she is 100% right, these people **are** savages. Run Suzanne Somers, run while you still can.\n\nDetective Darbo accidentally spills the beans that Frank and Suzanne Somers be fuckin', after a sitcom-mandated food fight. Because of course there's a food fight. It's in the contract. Frank further spills the beans that they're fuckin' in holy matrimony. He reveals this after JT repeatedly calls Suzanne Somers - a woman he does not know - a bimbo, because the Lamberts are an awful family who apparently never learned basic respect for other human beings.\n\nBut who cares because it's time for a **JAZZ RENDITION OF THE THEME SONG BABY!** Nothing says \"these two families are compatible\" like an instrumental bridge that sounds like it was recorded in a shopping mall in 1987.\n\n## Pig\n\n![frankdontcare2.jpg](stepbystepreviewed/frankdontcare2.jpg)\n\nFrank doesn't give a fuck that his new wife and family are in turmoil. Because Frank is just a walking boner. Every decision he makes is related to whether or not he gets to have sex with Suzanne Somers or not. His children could be on fire and he'd be like \"okay but can I bang my wife first?\"\n\n![pig.jpg](stepbystepreviewed/pig.jpg)\n\nSo anyway they brought a pig with them. Because they're a bunch of fucking slobs. Just casually transported livestock to their new blended family home. No big deal. Don't worry about it. The pig is probably going to be a recurring character, right? A beloved family pet that teaches them lessons about responsibility and caring for animals?\n\n**Wrong.** I bet the pig never shows up again. I **guarantee** the pig never shows up again. That's fine though, this pig could never live up to the pig from Boy Meets World, Little Corey. That was a much better show, and a much better pig. That pig had **range.** That pig had **depth.** This pig just shows up, grunts twice, and fucks off into the sitcom void forever.\n\n## Gaslighting: A Love Language\n\n![gaslighting-in-living-room.jpg](stepbystepreviewed/gaslighting-in-living-room.jpg)\n\nSuzanne Somers hates her shitty new caveman family. Bummer for her I guess. Can't imagine why she'd be upset about her children being terrorized by a pack of feral Lamberts who communicate exclusively through food fights and ketchup assault.\n\nIt's okay though because we have a scene of Frank gaslighting the shit out of this woman, for the second time in this one episode. I hate Frank. Frank is the worst. Frank's only character trait is \"horny\" and his only conflict resolution skill is \"convince Carol she's overreacting.\"\n\n## The Appendicitis Plot That Should Have Changed Everything (But Didn't)\n\n![800-dollar-breakfast.jpg](stepbystepreviewed/800-dollar-breakfast.jpg)\n\nAlright, so Suzanne Somers makes breakfast. I assume that'll be about $800 in food each morning. Or at least that's what I assumed before I noticed that it's like...a pile of untoasted white bread and 3 eggs. Honestly that works though, I feel like if you went to Waffle House and ordered the Step By Step Special they would serve you untoasted white bread and cold flavorless eggs.\n\nBut since this show is just a bundle of tropes being thrown at a wall, Frank just grabs a piece of toast. She even tells him they all eat together as a family, to which he basically says \"aw how cute\" and gets ready to fuck off out the door. Because Frank doesn't give a shit about family bonding or Suzanne Somers' feelings or the terrible looking eggs slowly congealing on the table. He's got contractor stuff to do. Important contractor business.\n\n![owie-tummy.jpg](stepbystepreviewed/owie-tummy.jpg)\n\nFrank is stopped when Al says she's sick. Frank doesn't believe her. That might have something to do with the scene literally 10 minutes ago in which Al pretended to be sick to get out of going to school. But anyway Frank basically tells her \"go to school you lying-ass loser\" and then runs out the door. Frank is a terrible father.\n\nAnyway Suzanne Somers believes her and checks her temperature. She's running a fever. A **real** fever. Oh shit. Oh fuck. This isn't fake sick. This is real sick. Her appendix bursts, and she dies on the way to the hospital, sadly never making it to the rest of the show. \n\nI thought it was a bold choice to kill Frank's youngest daughter immediately, but I respect it. Could you imagine if, instead, this show went from \"you're not my mom and you never will be!\" to hugs and \"maybe you're not so bad after all\" in the span of 2 minutes? God, that would be fucking horrific. That would be insulting to anyone who's ever had to navigate the complicated emotions of a blended family. Good thing this show would **never** do something that cheap and manipulative!\n\n![zit.jpg](stepbystepreviewed/zit.jpg)\n\nBut anyway, after Al dies, we get back to the extremely important zit subplot. Karen has a zit. That's the subplot. That's the entire B-story. A teenage girl has a pimple and is self-conscious about it. It's two scenes. So yeah that about wraps that up.\n\n## Don't Ever Touch Me\n\n![dont-ever-touch-me.jpg](stepbystepreviewed/dont-ever-touch-me.jpg)\n\n\"Don't ever touch me\" Dana says to JT. Correct. This is the correct response to JT. This is the only appropriate boundary to set with someone who murders animals in your locker. I'm glad someone in this family has survival instincts. \n\nWhy do all 17 members of the family need to be in the waiting room right now? Is there even any room for anyone else to sit? Did they kick out other families who were waiting for actual medical information? \"Sorry, your grandmother's in critical condition, but this blended family sitcom needs the whole waiting room for their emotional breakthrough scene.\"\n\n![thatguy.jpg](stepbystepreviewed/thatguy.jpg)\n\nHey, it's that guy! From the things in the 90s! You know him! He's here now, playing a doctor, because every working actor in Los Angeles appeared on at least one Miller-Boyett production in the 90s. It was in their contracts.\n\n![whocares.jpg](stepbystepreviewed/whocares.jpg)\n\nMark and Brendan get a scene where they have a stupid little kid talk about something. This is hell because Mark is involved, which means whatever bonding moment they're attempting is immediately ruined by his presence. Brendan contributes nothing because Brendan is a blank space where a character should be, a prop that occasionally moves and makes sounds. It has no effect on anything and nobody cares. \n\nCopy and paste the previous paragraph into any review of an episode of Step by Step.\n\n## The Most Saccharine Scene Ever Committed to Film\n\n![diabeetus.jpg](stepbystepreviewed/diabeetus.jpg)\n\nSadly Al made it through surgery. She's fine. Everything's fine. And now we go from \"you're not my mom and you never will be!\" *(17:45)* to \"sure you're my mom, I love you, we're family now\" *(19:10)* in **under two minutes flat.** Your perspective sure does change when you have a near-death experience. And also when you realize there's only two minutes left in the episode.\n\nThis show just assumes you know all the tropes and doesn't waste time trying to twist them or add anything to them. We're not here for nuance. We're just here for the greatest hits collection of sitcom bullshit. Play the touching music! Cue the hug! Everyone learned a lesson! Moving on!\n\n![tobefrank.jpg](stepbystepreviewed/tobefrank.jpg)\n\n## The Ending (Thank God)\n\n![coitus.jpg](stepbystepreviewed/coitus.jpg)\n\nFrank horny. Episode over. Applause. \n\nThat's it. That's the ending. Frank informs Suzanne Somers he wants to have sex for at least the fifth time in 22 minutes, the studio audience loses their minds like he just announced world peace, and we're done. Twenty-two minutes of your life you'll never get back. Seven seasons of this shit.\n\nGod help us all.\n\n## Best Patrika Darbo Moment\n\n![pants-creaming.jpg](stepbystepreviewed/pants-creaming.jpg)\n\nI thought \"Best Patrika Darbo Moment\" would be a fun little segment to end the review on, because Patrika Darbo is clearly everyone's favorite and most cherished Step By Step alumni. Plus she was only in 22 episodes so I wouldn't have to try very hard. And if there is truly one lesson we can learn from Step By Step, it's never trying very hard.\n\n**Best Patrika Darbo moment:** When Patrika Darbo blatantly, obviously, visually and audibly creamed her pants at the mere sight of Frank. That was a really cool and appropriate response to a stranger walking into a business. \n\nGive this woman an Emmy, you cowards.\n\n### BONUS: The Brady Bunch Test\n\nTo prove to you that Step By Step is not The Brady Bunch, I present to you an objective comparison of Step By Step vs The Brady Bunch, as told by the Brady Bunch theme song. \n\n**Here's the story of a lovely lady** ✔️ [There was in fact a lovely lady.] \n\n**Who was bringing up three very lovely girls.** ❌ [Two girls and a boy. A clever subversion.]\n\n**All of them had hair of gold, like their mother,** ❌ [Two of them had hair of gold, one of them was probably adopted.]\n\n**The youngest one in curls** ❌ [Mark's hair is straight, very clever. Bravo, Miller-Boyett Productions.]\n\n**Here's the story of a man named Brady** ❌ [This man's name was not Brady. His name is Lambert. Boom.]\n\n**Who was busy with three boys of his own** ✔️ [Two boys and a girl, so in total it's still three boys and three girls. Nice try Miller-Boyett. I bet you weren't expecting to be analyzed by a scholar of the GM-BTU.]\n\n**They were four men, living all together** ✔️[I just realized that you could rephrase the last two lines as \"There were one plus three guys. In total there were four guys.\" Stupid ass intro song. This has nothing to do with Step By Step.]\n\n**Yet they were all alone** ✔️ [Absolute bullshit, nobody in either of these shows was ever alone for more than five minutes. Being \"alone\" in this universe means only having seven people in the room instead of eight. It was bullshit in The Brady Bunch and it's bullshit here.]\n\n**Til the one day when the lady met this fellow** ✔️[On a vacation they each took without their children, alone, because they both hate their children (and can you blame them?).]\n\n**And they knew it was much more than a hunch** ✔️[Due to all the coitus.]\n\n**That this group must somehow form a family** ✔️[I wonder if they can somehow learn to come together despite their many differences? Wouldn't it be crazy if, through a series of mild misunderstandings and heartwarming moments, they learned that family isn't about blood, it's about tolerating each other's presence for seven seasons?]\n\n**That's the way we all became the Brady Bunch** ✔️[They did in fact become the Brady Bunch.]\n\n### FINAL SCORE \n\n8 out of 12 on the Brady Bunch Scale. **75% Brady.**\n\n### CONCLUSION \n\nI have lost control of my life. "
  }
]
